import 'package:flutter/material.dart';
import 'package:myapp/Custom/customContainer.dart';
class Doctor extends StatefulWidget {
  const Doctor({Key? key}) : super(key: key);

  @override
  State<Doctor> createState() => _DoctorState();
}

class _DoctorState extends State<Doctor> {
  List doctorName = [
    "ডাঃ মোঃ আতাউল গনি ওসমানী",
    "ডাঃ জোবাইদুল হক",
    "ডাঃ আনিসুর রহমান খান",
    "ডাঃ জি. ডি. মন্ডল",
    "ডাঃ আতাউল গণি ওসমানী",
    "ডাঃ মোঃ মাসরুর সিয়াম",
    "ডাঃ মোঃ হাফিজুর রহমান (পারভেজ)",
    "ডাঃ মোঃ আসাদুজ্জামান ফকির রনি",
    "ডাঃ মোঃ আবির হাসান",

  ];
  List doctorDegree = [
    "এম.বি.বি.এস (ঢাকা), বি.সি.এস (স্বাস্থ্য), এম.সি.পি.এস (মেডিসিন) এফ.সি.পি.এস (মেডিসিন)",
    "এম.বি.বি.এস (ঢাকা), বি.সি.এস (স্বাস্থ্য) এম.এস (ই.এন.টি)",
    "এমবিবিএস, এফসিপিএস (মেডিসিন), এমডি (কার্ডিওলজি)",
    "এমবিবিএস, বিসিএস (স্বাস্থ্য), এমডি, নিউরোমেডিসিন, এফসিপিএস (মেডিসিন ফাইনাল পার্ট)",
    "এমবিবিএস (ঢাকা), বিসিএস (স্বাস্থ্য) এমসিপিএস (মেডিসিন), এফসিপিএস (মেডিসিন)",
    "এমবিবিএস(ঢাকা),বিসিএস(স্বাস্থ্য)এফসিপিএস(মেডিসিন)(চূড়ান্ত পর্ব)এমআরসিপি (ইউকে-দ্বিতীয় পত্র) সি.সি. ডি (বারডেম)",
    "এমবিবিএস (ঢাকা) এমএস (কার্ডিয়াক সার্জারি)",
    "এমবিবিএস (ঢাকা), বিসিএস (স্বাস্থ্য) ডিএলও (ইএনটি)",
    "এমবিবিএস (ঢাকা), বিসিএস (স্বাস্থ্য),এফসিপিএস (মেডিসিন)",
    "",
  ];
  List category= [
    "মেডিসিন",
    "নাক-কান-গলা/ENT",
    "কার্ডিওলজি",
    "মেডিসিন ও নিউরোলজি বিশেষজ্ঞ",
    "মেডিসিন বিশেষজ্ঞ",
    "এন্ডোক্রিনোলজি",
    "কার্ডিয়াক সার্জারি",
    "ইএনটি",
    "মেডিসিন",

  ];
  List chamber = [
    "ডিজিটাল সেবা হাসপাতাল (প্রাঃ) নেত্রকোনা সর্বাধুনিক প্রযুক্তি নির্ভর হাসপাতাল ও ডায়াগনস্টিক সেন্টার মদন বাস স্ট্যান্ড, বনােয়াপাড়া, নেত্রকোনা রোগী দেখার সময়ঃ প্রতি বুধবার বিকাল ৩ টা থেকে সন্ধা ৭ টী পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৩১৮-২৪৭১৬০",
    "ডিজিটাল সেবা হাসপাতাল (প্রাঃ) নেত্রকোনা সর্বাধুনিক প্রযুক্তি নির্ভর হাসপাতাল ও ডায়াগনস্টিক সেন্টার মদন বাস স্ট্যান্ড, বনােয়াপাড়া, নেত্রকোনা রোগী দেখার সময়ঃ প্রতি শনি, সােম ও মঙ্গলবার বিকাল ৩ টা থেকে সন্ধা ৭ টা পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৩১৮-২৪৭১৬০",
    "নেত্রকোনা আইডিয়াল হাসপাতাল । দেখার সময়: শুক্রবার 10 AM - 6 PM ।\nসিরিয়ালের জন্যঃ ০১৭৪১০২৪০৬৪",
    "নেত্রকোনা আইডিয়াল হাসপাতাল । দেখার সময়: শুক্রবার 9 AM - 2:30 PM ।\nসিরিয়ালের জন্যঃ ০১৭৪১০২৪০৬৪",
    "প্রাইম হাসপাতাল ও ডায়াগনস্টিক সেন্টার, নেত্রকোনা দেখার সময়: প্রতি মঙ্গলবার এবং বুধবার, দুপুর 2 টা থেকে 6 টা পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৯৭১৮৬২০৯২ ",
    "প্রাইম হাসপাতাল ও ডায়াগনস্টিক সেন্টার, নেত্রকোনা দেখার সময়: প্রতি শুক্রবার , দুপুর 10 টা থেকে 6 টা পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৯৭১৮৬২০৯২ ",
    "প্রাইম হাসপাতাল ও ডায়াগনস্টিক সেন্টার, নেত্রকোনা দেখার সময়: প্রতি শুক্রবার , দুপুর 10 টা থেকে 6 টা পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৯৭১৮৬২০৯২ ",
    "প্রাইম হাসপাতাল ও ডায়াগনস্টিক সেন্টার, নেত্রকোনা দেখার সময়: প্রতি শুক্রবার , দুপুর 10 টা থেকে 6 টা পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৯৭১৮৬২০৯২ ",
    "প্রাইম হাসপাতাল ও ডায়াগনস্টিক সেন্টার, নেত্রকোনা দেখার সময়: প্রতি শুক্রবার , দুপুর 10 টা থেকে 6 টা পর্যন্ত।\nসিরিয়ালের জন্যঃ ০১৯৭১৮৬২০৯২ ",

  ];
  List call = [
    "01318247160",
    "01318247160",
    "01741024064",
    "01741024064",
    "01971862092",
    "01971862092",
    "01971862092",
    "01971862092",
    "01736695636",
    "",
  ];
String image = "Images/GridView/doctor.jpg";


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('ডাক্টার',
          style: TextStyle(
              fontSize: 20.0
          ),),
      ),
      body: Center(
        child: SingleChildScrollView(
          child: Column(
            children: [
              for(int i=0;i<doctorName.length;i++)
                myContainer(doctorName[i], doctorDegree[i], image, chamber[i],category[i],call[i], 1)
            ],
          ),
        )
      ),
    );
  }
}
