import 'package:flutter/material.dart';
import 'Custom/FamProfile.dart';
import 'Custom/customContainer.dart';
class Famous extends StatefulWidget {
  const Famous({Key? key}) : super(key: key);

  @override
  State<Famous> createState() => _FamousState();
}

class _FamousState extends State<Famous> {

  List Image = [
    'Images/Famous/humayunAhmed.png',
    'Images/Famous/moniSing.png',
    'Images/Famous/NimalandoGoon.png',
    'Images/Famous/aliSiddiqi.png',
    'Images/Famous/bariSiddiqi.png',
    'Images/Famous/colonelTaher.png',
    'Images/Famous/sahbuddin.png',
    'Images/Famous/mustofaJobbar.png',
    'Images/Famous/chandroKumar.png',
    'Images/Famous/mInnasAli.png',
    'Images/Famous/ahsanHabib.png',
    'Images/Famous/jotinSarker.png',
    'Images/Famous/asimSaha.png',
    '',
  ];
  List name = [
    'হুমায়ুন আহমেদ',
    'কমরেড মনি সিং',
    'নির্মলেন্দু গুণ',
    'মোহাম্মদ আলী সিদ্দিকী',
    'বারী সিদ্দিকী',
    'কর্ণেল আবু তাহের',
    'সাহাবুদ্দিন আহমেদ',
    'মোস্তাফা জব্বার',
    'চন্দ্র কুমার দে',
    'এম ইন্নাস আলী',
    'আহসান হাবীব',
    'যতীন সরকার',
    'অসীম সাহা',
  ];
  List Designation = [
    'লেখক, নাট্যকার ও চলচ্চিত্র পরিচালক',
    'বিশিষ্ট বাঙালি কমিউনিস্ট রাজনীতিবিদ',
    'কবি',
    'গায়ক, সুরকার এবং সঙ্গীত পরিচালক',
    'গায়ক-গীতিকার এবং বাঁশিবাদক',
    'সামরিক কর্মী',
    'সাবেক রাষ্ট্রপতি ও প্রধান বিচারপতি',
    'ব্যবসায়ী, প্রযুক্তি উদ্যোক্তা এবং\nবর্তমান ডাক ও টেলিযোগাযোগ মন্ত্রী',
    'মধ্যযুগীয় লোককাহিনী এবং\nলোকগানের লেখক এবং সংগ্রাহক',
    'পদার্থবিদ',
    'কার্টুনিস্ট ও লেখক',
    'বুদ্ধিজীবী, গবেষক এবং জীবনীকার',
    'কবি এবং ঔপন্যাসিক',
    '',
  ];
List Details = [
'হুমায়ূন আহমেদ (13 নভেম্বর 1948 - 19 জুলাই 2012) ছিলেন একজন বাংলাদেশী ঔপন্যাসিক, নাট্যকার, চিত্রনাট্যকার, চলচ্চিত্র নির্মাতা, গীতিকার, পণ্ডিত এবং প্রভাষক। 1972 সালে প্রকাশিত তাঁর প্রথম উপন্যাস নন্দিতো নরোকে তাঁর অগ্রগতি। 1990 এবং 2000 এর দশকে একুশে বইমেলায় তার বইগুলি শীর্ষ বিক্রেতা ছিল। বাংলা সাহিত্যে অবদানের জন্য তিনি 1981 সালে বাংলা একাডেমি সাহিত্য পুরস্কার এবং 1994 সালে একুশে পদক লাভ করেন।',
'মনি সিং (২৮ জুন 1901, দুর্গাপুর উপজেলা, নেত্রকোনা - 31 ডিসেম্বর 1990, ঢাকা) ছিলেন একজন বিশিষ্ট বাঙালি কমিউনিস্ট রাজনীতিবিদ যিনি কমরেড মনি সিং নামে পরিচিত। তিনি ছিলেন পূর্ব পাকিস্তানের কমিউনিস্ট পার্টির প্রতিষ্ঠাতা। সিং 1971 সালে বাংলাদেশের স্বাধীনতা যুদ্ধের সময় মুক্তিবাহিনীর একটি গেরিলা শাখা পরিচালনা করেছিলেন এবং বাংলাদেশের অস্থায়ী সরকারের একজন উপদেষ্টা ছিলেন।',
'নির্মলেন্দু গুণ (জন্ম 21 জুন 1945) একজন বাংলাদেশী কবি যিনি তাঁর অ্যাক্সেসযোগ্য পদ্যের জন্য পরিচিত। তিনি 2001 সালে একুশে পদক এবং 2016 সালে বাংলাদেশ সরকার কর্তৃক স্বাধীনতা দিবস পুরস্কারে ভূষিত হন। এছাড়াও তিনি 1982 সালে বাংলা একাডেমি সাহিত্য পুরস্কারে ভূষিত হন।',
'মোহাম্মদ আলী সিদ্দিকী (2 ফেব্রুয়ারি 1944 - 4 নভেম্বর 2014) ছিলেন একজন বাংলাদেশী প্লেব্যাক গায়ক। তিনি 1960, 1970 এবং 1980 এর দশকে একজন গায়ক ছিলেন। তিন দশকের কর্মজীবনে তিনি মোট 3,500টি গান গেয়েছেন। তিনি জাতীয় পুরস্কার, দীনেশ পদক, বন্ধন আজীবন পুরস্কার এবং শিল্পকলা একাডেমি পুরস্কারসহ বেশ কিছু পুরস্কারে ভূষিত হন।',
'বারী সিদ্দিকী (15 নভেম্বর 1954 - 24 নভেম্বর 2017) একজন বাংলাদেশী গায়ক-গীতিকার এবং বাঁশিবাদক ছিলেন। তার গানের মধ্যে রয়েছে শুয়া চান পাখি, আমার গায়ে যত দুঃখ শোয়, পূবালি বাতাসে এবং মানুষ ধোরো মানুষ ভোজো।',
'আবু তাহের (14 নভেম্বর 1938 - 21 জুলাই 1976) ছিলেন একজন বাঙালি সামরিক কর্মী, যিনি পাকিস্তান সেনাবাহিনীতে কাজ করেছিলেন এবং 17 আগস্ট থেকে 2 নভেম্বর 1971 পর্যন্ত বিডিএফ-এ একটি সংক্ষিপ্ত সময়ের জন্য। মুক্তিযুদ্ধে বীরত্বের জন্য বীরউত্তম পদক। স্বাধীনতার পর তিনি লেফটেন্যান্ট কর্নেল পদে প্রশাসনিক অবসরে বাংলাদেশ সেনাবাহিনীতে যোগদান করেন। তিনি একজন উগ্র রাজনৈতিক কর্মী এবং বামপন্থী জাতীয় সমাজতান্ত্রিক দলের নেতাতে পরিণত হন।',
'শাহাবুদ্দিন আহমেদ (1 ফেব্রুয়ারি 1930 - 19 মার্চ 2022) 1996 থেকে 2001 পর্যন্ত বাংলাদেশের রাষ্ট্রপতি এবং 1990 থেকে 1995 সাল পর্যন্ত বাংলাদেশের প্রধান বিচারপতি হিসেবে দায়িত্ব পালন করেন। তিনি এর আগে 1990-91 সালে ভারপ্রাপ্ত রাষ্ট্রপতি হিসেবে দায়িত্ব পালন করেন যখন হুসেইন মুহম্মদ এরশাদ পদত্যাগ করেন। পোস্টটি. তিনি একটি তত্ত্বাবধায়ক সরকারের নেতৃত্ব দেন এবং 1991 সালের ফেব্রুয়ারিতে একটি সাধারণ নির্বাচন অনুষ্ঠিত হয়।',
'মোস্তাফা জব্বার (জন্ম 12 আগস্ট 1949) একজন বাংলাদেশী ব্যবসায়ী, প্রযুক্তি উদ্যোক্তা এবং বাংলাদেশ সরকারের বর্তমান ডাক ও টেলিযোগাযোগ মন্ত্রী। তিনি বাংলাদেশ অ্যাসোসিয়েশন অব সফটওয়্যার অ্যান্ড ইনফরমেশন সার্ভিসেস (বেসিস)-এর সভাপতি হিসেবেও দায়িত্ব পালন করেছেন। তিনি বিজয় বাংলা কীবোর্ড তৈরির জন্য সবচেয়ে বেশি পরিচিত, যেটি 1988 সালে তৈরি করা হয়েছিল এবং ইউনিকোড ভিত্তিক অভ্র কীবোর্ড প্রকাশের আগ পর্যন্ত এটি বাংলা ইনপুট পদ্ধতিতে সর্বাধিক ব্যবহৃত হয়েছিল। তিনি টানা চার মেয়াদে বাংলাদেশের জাতীয় আইসিটি সংস্থা বাংলাদেশ কম্পিউটার সমিতির সভাপতি হিসেবে দায়িত্ব পালন করেন। তিনি বাংলাভাষা প্রচলন আইন, 1987 (বাংলা ভাষা প্রচলন আইন, ১৯৮৭; বাংলা ভাষা বাস্তবায়ন আইন, 1987) এর একজন চ্যাম্পিয়ন এবং ডিজিটাল মিডিয়াতে বাংলা ভাষার প্রচারের জন্য প্রশংসিত হয়েছেন।',
'চন্দ্র কুমার দে (1889-1946) ছিলেন একজন লেখক এবং মধ্যযুগীয় লোককাহিনী এবং পূর্ব বাংলার লোকগানের সংগ্রাহক, বেশিরভাগই এখন বাংলাদেশের ময়মনসিংহে। আজ, তিনি বাংলার একজন গুরুত্বপূর্ণ লোকগাথা সংগ্রাহক, এবং তাঁর সংগৃহীত গীতিনাট্যগুলি বাংলা লোকসাহিত্যের একটি গুরুত্বপূর্ণ অংশ, সেগুলি কলকাতা বিশ্ববিদ্যালয় দ্বারা মৃমনসিংহ গীতিকা (1923) এবং পূর্ববঙ্গ গীতিকা (1923-1932) নামে প্রকাশিত হয়েছিল, পরে ইংরেজিতে প্রকাশিত হয়েছিল। ইস্টার্ন বেঙ্গল ব্যালাডস হিসেবে।',
'এম ইন্নাস আলী (সেপ্টেম্বর 1, 1916 - 3 মে, 2010) একজন বাংলাদেশী পদার্থবিদ ছিলেন। তিনি বাংলাদেশ পরমাণু শক্তি কমিশনের প্রতিষ্ঠাতা চেয়ারম্যান ছিলেন। তিনি 1994 সালে বাংলাদেশের জাতীয় অধ্যাপক নির্বাচিত হন।',
'আহসান হাবীব একজন বাংলাদেশী কার্টুনিস্ট, লেখক এবং ব্যঙ্গাত্মক পত্রিকা উনমাদের সম্পাদক।',
'যতীন সরকার (জন্ম: ১ সেপ্টেম্বর ১৯৩৮) বাংলাদেশের একজন বাঙালি বুদ্ধিজীবী, গবেষক এবং জীবনীকার। "গবেষণা ও প্রবন্ধ" এর জন্য তিনি ২০০৮ সালে মর্যাদাপূর্ণ বাংলা একাডেমী সাহিত্য পুরস্কারে ভূষিত হন।',
'অসীম সাহা (জন্ম 20 ফেব্রুয়ারি 1949) একজন বাংলাদেশী কবি এবং ঔপন্যাসিক। কবিতায় অবদানের জন্য তিনি ২০১১ সালে বাংলা একাডেমি সাহিত্য পুরস্কার পান। বাংলা ভাষা ও সাহিত্যে তার অবদানের স্বীকৃতিস্বরূপ, বাংলাদেশ সরকার তাকে 2019 সালে দেশের দ্বিতীয় সর্বোচ্চ বেসামরিক পুরস্কার একুশে পদকে ভূষিত করে।',
'',
'',
'',
'',
];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('স্বনামধন্য ব্যক্তিবর্গ',
          style: TextStyle(
              fontSize: 20.0
          ),),
      ),
      body: Center(
        child: SingleChildScrollView(
          child: Column(
            children: [
              for(int i=0;i<13;i++)
                myContainer(name[i],Designation[i],Image[i],Details[i],"","",0),
            ],
          ),
        )
      ),
    );
  }
}
